#+OPTIONS: toc:nil

* Special Pythagorean Triplet

** Task

A Pythagorean triplet is a set of three natural numbers, a < b < c, for which,

a^2 + b^2 = c^2
For example, 3^2 + 4^2 = 9 + 16 = 25 = 52.

There exists exactly one Pythagorean triplet for which a + b + c = 1000.
Find the product abc.

** Solution

#+BEGIN_SRC python :results output :exports both
import math

found = False
for c in range(0, 1000):
    for b in range(0, c):
        for a in range(0, b):
            if a + b + c == 1000:
                if math.pow(a, 2) + math.pow(b, 2) == math.pow(c, 2):
                    found = True
                    print(a * b * c)
            if found:
                break
        if found:
            break
    if found:
        break
#+END_SRC

#+RESULTS:
: 31875000
